app/controllers/api/v1/person_controller.rb

SELECT `certificates`.* FROM `certificates` WHERE `certificates`.`person_id` = 2
---
    def education
      certs = []
      @person.certificates.each do |cert|