app/controllers/api/v1/resume_controller.rb

    def jobs
      since = params[:since]
      if !since.nil?
        since_date = DateTime.strptime since, '%m/%d/%Y'
        jobs = Role.in_resume(@resume).since(since_date)
        raise Errors::JobsNotFound unless jobs.count > 0
      else
        jobs = @resume.jobs
        raise Errors::JobsNotFound unless jobs.count > 0
      end

      result = {
          :companies => [],
          :jobs => []
      }

      jobs.each do |job|
        # companies
        index = result[:companies].find_index {|company| company.id == job.company_id}
        if index.nil?
          result[:companies] << job.company
        end

        # jobs
        job_json = job.to_json :include => {:projects => {:include => [{:accomplishments => {:except => [:id, :associated_id, :associated_type]}}, :tags, {:apps => {:except => [:id, :project_id]}}], :except => [:role_id, :id]}}, :except => [:id, :resume_id]
        tmpJob = ActiveSupport::JSON.decode(job_json)
        tmpJob['projects'].each {|p| unless p['apps'].length > 0; p.delete('apps'); end }
---
SELECT COUNT(*) FROM `roles` WHERE `roles`.`resume_id` = 2
SELECT `roles`.* FROM `roles` WHERE `roles`.`resume_id` = 2
SELECT `apps`.* FROM `apps` WHERE `apps`.`project_id` = 2

    def jobs_by_tags
      projects = Project.in_resume @resume
      raise Errors::ProjectsNotFound unless projects.count > 0

      tags = params[:tags].split(',').map { |x| x.to_i }
      filtered_projects = []

      projects.each do |project|
        project_tags = project.tags.collect { |t| t.id }.uniq
---
SELECT `tags`.* FROM `tags` INNER JOIN `projects_tags` ON `tags`.`id` = `projects_tags`.`tag_id` WHERE `projects_tags`.`project_id` = 2